Dotfiles.org
#+title: My Dotfiles
#+author: Ranko Kohime
#+email: ranko.kohime@runbox.com
#+startup: content
;#+property: header-args :mkdirp yes :tangle-mode (identity #o444) :comments both

* Notes
Reminder: Disable code blocks by wrapping in square brackets [ ]

https://ashok-khanna.medium.com/formatting-lisp-5e28020b8bac


Cyberpunk Theme
https://github.com/n3mo/cyberpunk-theme.el

Monokai Theme
https://github.com/oneKelvinSmith/monokai-emacs

Doom Emacs requires rg, or ripgrep
Also requires fd, or find
and one of the following: markedjs, pandoc, or multimarkdown


* DONE Premable
** DONE Enable custom load-path
[[https://www.emacswiki.org/emacs/LoadPath][Emacs Wiki: LoadPath]]
#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.config/emacs/custom")
#+end_src

**** DONE Enable Melpa package repository
#+begin_src emacs-lisp
  (require 'package)
  (add-to-list
    'package-archives
    '("melpa" . "https://melpa.org/packages/") t)
#+end_src

**** DONE Install use-package if not already installed
[[https://github.com/jwiegley/use-package][use-package GitHub]]
#+begin_src emacs-lisp
  (unless
    (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (eval-when-compile
    (require 'use-package))
#+end_src

*** TODO Packages to install
#+begin_src emacs-lisp
  [(custom-set-variables
    '(package-selected-packages
      '(
        evil
        evil-org
        exercism
        markdown-mode
        org-beautify-theme
        org-evil
        paradox)))]
#+end_src

*** TODO Install and configure Ansible packages
#+begin_src emacs-lisp
  (use-package ansible
               :ensure t)
  (add-hook 'yaml-mode-hook #'(lambda () (ansible 1)))

  (use-package ansible-doc
               :ensure t)
  (use-package ansible-vault
               :ensure t)
               (setq-default
                ansible-vault-password-file
                "~/.ansible/vault_pass")
  [(use-package autocomplete
               :ensure t)]
  (use-package yasnippet
               :ensure t)
#+end_src
*** DONE Enable Git integration with Magit
[[https://magit.vc/][Magit Website]]
#+begin_src emacs-lisp
  (use-package magit
    :ensure t)
  (global-set-key (kbd "C-c g") 'magit-file-dispatch)
#+end_src

*** TODO Enable ChatGPT integration
[[https://github.com/rksm/org-ai][org-ai GitHub]]
#+begin_src emacs-lisp
  (use-package org-ai
    :ensure t
    :commands (org-ai-mode
               org-ai-global-mode)
    :init
    (add-hook 'org-mode-hook #'org-ai-mode) ; enable org-ai in org-mode
    (org-ai-global-mode) ; installs global keybindings on C-c M-a
    :config
    ;(setq org-ai-default-chat-model "gpt-4") ; if you are on the gpt-4 beta:
    ;(org-ai-install-yasnippets) ; if you are using yasnippet and want `ai` snippets
    )
#+end_src

*** DONE Install unicode-emoticons
#+begin_src emacs-lisp
  (use-package unicode-emoticons
               :ensure t)
#+end_src

*** TODO Enable password-store integration
#+begin_src emacs-lisp
  (use-package password-store
               :ensure t)
#+end_src

** TODO Visual Settings
*** DONE Enable custom themes
Default to theme [[https://github.com/inlinestyle/emacs-cherry-blossom-theme][Cherry Blossom]]
#+begin_src emacs-lisp
    (use-package cyberpunk-theme
                 :ensure t)
    (custom-set-variables
      '(custom-enabled-themes
        '(cyberpunk))
      '(custom-safe-themes
        '("e9d47d6d41e42a8313c81995a60b2af6588e9f01a1cf19ca42669a7ffd5c2fde" default)))
#+end_src

*** DONE Inhibit the startup message
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
#+end_src

*** DONE Disable the GUI Toolbar
#+begin_src emacs-lisp
  (if window-system
    (tool-bar-mode 0))
#+end_src

*** DONE Disable the Menubar
#+begin_src emacs-lisp
  (menu-bar-mode -1)
#+end_src

*** TODO Show fill column indicator (Line 80)
#+begin_src emacs-lisp
  (use-package fill-column-indicator
               :ensure t
               :init
                 (global-display-fill-column-indicator-mode t)
                 (setq-default display-fill-column-indicator-character "‖")
                 (setq-default fill-column 80))
                 [(set-face-background 'fill-column-indicator brightwhite)]
#+end_src

*** DONE Highlight the current row and column to make the cursor easy to find
C-c SPC to flash xhair
#+begin_src emacs-lisp
  (use-package xhair
               :ensure t)
  (global-set-key (kbd "C-c SPC") 'xhair-flash)
#+end_src

*** DONE Enable line numbers, and make them a bit pretty
#+begin_src emacs-lisp
  (global-display-line-numbers-mode)
  (custom-set-variables
    '(display-line-numbers-type 'visual))
  (custom-set-faces
    '(line-number-current-line
      ((t (:foreground "black"
           :background "yellow"
           :inherit line-number))))
    '(shadow ((t (:background "color-235"
                  :foreground "#999999")))))
#+end_src

*** TODO Highlight parentheses
#+begin_src emacs-lisp
  (show-paren-mode t)
  (custom-set-variables
    '(show-paren-style 'parenthesis)
    '(show-paren-highlight-openparen t)
    '(show-paren-ring-bell-on-mismatch t)
    '(show-paren-when-point-in-periphery t)
    '(show-paren-when-point-inside-paren t))
  [(define-globalized-minor-mode
    global-highlight-parentheses-mode
    highlight-parentheses-mode
    (lambda nil
      (highlight-parentheses-mode t)))
  (global-highlight-parentheses-mode t)]
#+end_src

*** DONE Address useless whitespace
[[https://emacsdocs.org/docs/emacs/Useless-Whitespace][Emacs Docs 14.16: Useless-Whitespace]]
#+begin_src emacs-lisp
  (setq-default show-trailing-whitespace t)
  (setq-default indicate-empty-lines t)
#+end_src

*** TODO Highlight indentation
Double check this in GUI mode, not satisfactory in terminal
[[https://github.com/DarthFennec/highlight-indent-guides][highlight-indent-guides GitHub]]
#+begin_src emacs-lisp
  (use-package highlight-indent-guides
               :ensure t)
  (custom-set-variables
   '(highlight-indent-guides-method 'character)
   '(highlight-indent-guides-responsive 'stack))
  (add-hook 'org-mode-hook 'highlight-indent-guides-mode)
  (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
#+end_src

*** DONE RULER MODE! (Suck it, Vim)
[[https://www.emacswiki.org/emacs/RulerMode][Emacs Wiki: Ruler Mode]]
#+begin_src emacs-lisp
  [(setq-default ruler-mode)]
  (add-hook 'find-file-hook (lambda () (ruler-mode 1)))
#+end_src

*** DONE Scrolloff (move viewport when point approaches top or bottom of screen)
#+begin_src emacs-lisp
  (setq-default scroll-margin 5)
#+end_src

** DONE Org Mode
*** DONE Enable Org Mode (is this superfluos?)
#+begin_src emacs-lisp
  (require 'org)
#+end_src

*** DONE Set font lock for Org Mode, just in case
#+begin_src emacs-lisp
  (add-hook 'org-mode-hook #'turn-on-font-lock)
#+end_src

*** DONE Enable org-tempo
Expands e.g. <s to code blocks
#+begin_src emacs-lisp
  (require 'org-tempo)
#+end_src

*** DONE Set indent mode
#+begin_src emacs-lisp
  (setq-default org-indent-mode t)
  (setq-default org-startup-indented t)
#+end_src
*** DONE Set the agenda key, in case it's not set
#+begin_src emacs-lisp
  (global-set-key "\C-ca" 'org-agenda)
#+end_src

*** DONE Set keywords for Org Mode
#+begin_src emacs-lisp
  (setq org-todo-keywords
    '((sequence "TODO" "STRT" "WAIT" "DONE")))
#+end_src

*** DONE Set org-startup-folded
#+begin_src emacs-lisp
  (setq-default org-startup-folded 'content)
#+end_src

*** DONE Enable list decoration bullets
[[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode GitHub]]
#+begin_src emacs-lisp
  (use-package org-superstar
               :ensure t)
  (add-hook 'org-mode-hook
            (lambda ()
              (org-superstar-mode 1 )))
#+end_src

*** DONE Hide leading stars in lists
#+begin_src emacs-lisp
  (setq org-hide-leading-stars t)
#+end_src

*** DONE Change header fold indicator
#+begin_src emacs-lisp
  (setq-default org-ellipsis " §")
  (set-face-underline 'org-ellipsis nil)
#+end_src

*** DONE Use syntax highlighting in source blocks while editing
#+begin_src emacs-lisp
  (setq org-src-fontify-natively t)
#+end_src

*** DONE Enable block wrapping using wrap-region
[[https://github.com/rejeep/wrap-region.el][Wrap Region GitHub]]
Does not work with Evil mode!
#+begin_src emacs-lisp
  (use-package wrap-region
               :ensure t)
  (wrap-region-global-mode t)
  (wrap-region-add-wrapper "#+begin_src \n" "#+end_src" "#" 'org-mode)
#+end_src

*** TODO Add org-ac for auto completion
(use-package org-ac
             :ensure t)

*** TODO Auto-tangling
(use-package org-auto-tangle
             :ensure t
             :defer t
             :hook (org-mode . org-auto-tangle-mode))
(setq-default org-auto-tangle-default t)

** TODO Key Bindings
*** DONE Make ESC quit prompts
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

*** DONE Enable Evil mode
#+begin_src emacs-lisp
  (use-package evil
               :ensure t
               :init (setq-default evil-want-C-i-jump nil
                                   evil-shift-width 2
                                   evil-move-beyond-eol t))
  (evil-mode t)
#+end_src

*** DONE Enable evil-org
#+begin_src emacs-lisp
  (use-package evil-org
               :ensure t)
  (require 'evil-org)
#+end_src
** TODO Set leader key to Space
;; Set leader key to Space (if it isn't already set)

** TODO Set leader-based keys
;; Set <leader>x to cut to system clipboard
;; Set <leader>c to copy to system clipboard
;; Set <leader>v to paste from system clipboard
;; Set <leader>s to save
;; Set <leader>w to save and close the current buffer
;; Set <leader>e to open a file
#+begin_src emacs-lisp
#+end_src


** Modeline
  Reminder: there is also a [[https://www.emacswiki.org/emacs/HeaderLine][Header Line]]
*** Appearance
   Potentially use [[https://github.com/Malabarba/smart-mode-line][smart-mode-line]]?
**** mode-line-format
[[https://www.emacswiki.org/emacs/ModeLineConfiguration][Mode Line Configuration]]
[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Mode-Line-Variables.html][Mode Line Variables]]
#+begin_src emacs-lisp
  [(setq-default mode-line-format
    (list
      "%e" mode-line-front-space
               ; %e is out of memory warning
               ; front-space evaluates to dash (-) if in terminal
      (:propertize
        ("" evil-mode-line-tag
            "  "
            mode-line-mule-info
            mode-line-client
            mode-line-modified
               ; ‘**’ if the buffer is modified
               ; ‘--’ if the buffer is not modified
               ; ‘%%’ if the buffer is read only
               ; and ‘%*’ if the buffer is read only and modified.
            mode-line-remote)
        display (min-width (5.0)))
        mode-line-frame-identification
               ; This variable identifies the current frame. Its default
               ; value displays " " if you are using a window system which
               ; can show multiple frames, or "-%F " on an ordinary
               ; terminal which shows only one frame at a time.
        mode-line-buffer-identification
               ; File name currently open, or special buffer
        "   "
        mode-line-position
        (vc-mode vc-mode)
               ; Git indicator
        "  "
        mode-line-modes
               ; Yeah I have no clue
        mode-line-misc-info
        mode-line-end-spaces
        " "
        display-time-string
               ; Show clock at right end of mode line
        " "))]
#+end_src
*** Content
**** DONE Show line and column numbers in mode line
#+begin_src emacs-lisp
  (setq-default line-number-mode t)
  (setq-default column-number-mode t)
#+end_src

**** DONE Show clock in mode line
#+begin_src emacs-lisp
  (setq-default display-time-mode t)
#+end_src

** TODO General Settings
*** DONE Set personal information
#+begin_src emacs-lisp
  (setq user-full-name "Ranko Kohime"
        user-mail-address "ranko.kohime@runbox.com")
#+end_src

*** TODO Enable CUA mode for C-x, C-c, C-v
#+begin_src emacs-lisp
  [(custom-set-variables
    '(cua-mode t nil
      (cua-base)))]
#+end_src

*** DONE Enable file history with recentf, and periodically save the list
[[https://www.emacswiki.org/emacs/RecentFiles][Emacs Wiki: Recent Files]]
#+begin_src emacs-lisp
  (recentf-mode 1)
  (setq recentf-max-menu-items 25)
  (setq recentf-max-saved-items 25)
  (global-set-key "\C-x\ \C-r" 'recentf-open-files)
  (run-at-time nil (* 15 60) 'recentf-save-list)
#+end_src

*** DONE Suppress certain types of startup messages
#+begin_src emacs-lisp
  (custom-set-variables
    '(warning-suppress-types '((comp)
      (use-package))))
#+end_src

*** DONE Spaces instead of tabs
[[https://www.emacswiki.org/emacs/NoTabs][Emacs Wiki: No Tabs]]
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
#+end_src

** TODO Collaborative Editing
[[https://code.librehq.com/qhong/crdt.el/][crdt.el Git Repo]]

** DONE And Finally…
*** DONE The Success Message
#+begin_src emacs-lisp
  (setq initial-scratch-message
        (concat
          ";;░█▀▀░█▄█░█▀█░█▀▀░█▀▀\n"
          ";;░█▀▀░█░█░█▀█░█░░░▀▀█\n"
          ";;░▀▀▀░▀░▀░▀░▀░▀▀▀░▀▀▀\n"
          "\n"
          ";;  Task Failed Successfully.\n"))
#+end_src


* MangoHud
:properties:
:header-args+: :tangle .config/MangoHud/MangoHud.conf
:header-args+: :tangle-mode (identity #o444)
:header-args+: :comments both
:end:
### MangoHud configuration file
### Uncomment any options you wish to enable. Default options are left uncommented
### Use some_parameter=0 to disable a parameter (only works with on/off parameters)
### Everything below can be used / overridden with the environment variable MANGOHUD_CONFIG instead
** Performance
*** Limit the application FPS.
Comma-separated list of one or more FPS values (e.g. 0,30,60). 0 means unlimited (unless VSynced).
#+begin_src conf
# fps_limit=
#+end_src

*** VSync
[0-3] 0 = adaptive; 1 = off; 2 = mailbox; 3 = on
#+begin_src conf
# vsync=
#+end_src

*** OpenGL VSync
[0-N] 0 = off; >=1 = wait for N v-blanks, N > 1 acts as a FPS limiter (FPS = display refresh rate / N)
#+begin_src conf
# gl_vsync=
#+end_src

** Visual
*** Custom text centered useful for a header
#+begin_src conf
# custom_text_center =
#+end_src

*** Legacy layout
#+begin_src conf
legacy_layout = false
#+end_src

*** Display the current CPU information
#+begin_src conf
cpu_stats
cpu_temp
cpu_power
# cpu_text = "CPU"
cpu_mhz
cpu_load_change
cpu_load_value
cpu_load_color
#+end_src

*** Display the current GPU information
#+begin_src conf
gpu_stats
gpu_temp
gpu_core_clock
gpu_mem_clock
gpu_name
gpu_power
# gpu_text = "GPU"
# vulkan_driver
gpu_load_change
gpu_load_value
gpu_load_color
#+end_src

*** Display FPS and frametime
#+begin_src conf
fps
# fps_sampling_period=
frametime
#+end_src

*** Display loaded MangoHud architecture
#+begin_src conf
# arch
#+end_src

*** Display the frametime line graph
#+begin_src conf
frame_timing
histogram
#+end_src

*** Display the current system time
#+begin_src conf
# time
#+end_src

*** Display the current resolution
#+begin_src conf
# resolution
#+end_src

*** Show current fps limit
#+begin_src conf
#  show_fps_limit
#+end_src

*** Display custom text
#+begin_src conf
# custom_text
#+end_src

*** Time formatting examples
#+begin_src conf
# time_format = %H:%M
# time_format = [ %T %F ]
# time_format = %X # locally formatted time, because of limited glyph range, missing characters may show as '?' (e.g. Japanese)
#+end_src

*** Change the hud font size (default is 24)
#+begin_src conf
font_size=16
# font_scale=1.0
# font_size_text=24
# font_scale_media_player = 0.55
# no_small_font
#+end_src

*** Change default font (set location to .TTF/.OTF file )
**** Set font for the whole hud
#+begin_src conf
# font_file=
#+end_src

**** Set font only for text like media player metadata
#+begin_src conf
# font_file_text=
#+end_src

**** Set font glyph ranges.
Defaults to latin-only. Don't forget to set font_file/text_font_file to font that
supports these.  Probably don't enable all at once because of memory usage and
hardware limits concerns.  If you experience crashes or text is just squares,
reduce glyph range or reduce font size.
#+begin_src conf
# font_glyph_ranges=korean, chinese, chinese_simplified, japanese, cyrillic, thai, vietnamese, latin_ext_a, latin_ext_b
#+end_src

*** Change the hud position (default is top-left)
#+begin_src conf
position=top-left
#+end_src

*** Display the current CPU load & frequency for each core
#+begin_src conf
# core_load
# core_load_change
#+end_src

*** IO read and write for the app (not system)
#+begin_src conf
# io_read
# io_write
# io_stats
#+end_src

*** Display system ram / swap space / vram usage
#+begin_src conf
ram
# swap
vram
#+end_src

*** Display MangoHud, engine or Wine version
#+begin_src conf
# version
# engine_version
# wine
#+end_src

*** Disable / hide the hud by default
#+begin_src conf
# no_display
#+end_src

*** Hud position offset
#+begin_src conf
# offset_x=
# offset_y=
#+end_src

*** Hud dimensions
#+begin_src conf
# width=
# height=
# table_columns=
# cellpadding_y=
#+end_src

*** Hud transparency / alpha
#+begin_src conf
background_alpha=0.5
# alpha=
#+end_src

*** Color customization
#+begin_src conf
# text_color=FFFFFF
# gpu_color=2E9762
# cpu_color=2E97CB
# vram_color=AD64C1
# ram_color=C26693
# engine_color=EB5B5B
# io_color=A491D3
# frametime_color=00FF00
# background_color=020202
# media_player_color=FFFFFF
# wine_color=732010
#+end_src

*** Show media player metadata
#+begin_src conf
# media_player
# media_player_name = spotify
# media_player_order = title,artist,album
#+end_src

*** Specify gpu with pci bus id for amdgpu and NVML stats.
Set to 'domain:bus:slot.function'
#+begin_src conf
# pci_dev = 0:0a:0.0
#+end_src

*** Blacklist
#+begin_src conf
# blacklist =
#+end_src

** Workarounds
Options starting with "gl_*" are for OpenGL.
*** Specify what to use for getting display size.
Options are "viewport", "scissorbox" or disabled. Defaults to using glXQueryDrawable.
#+begin_src conf
# gl_size_query = viewport
#+end_src

*** (Re)bind given framebuffer before MangoHud gets drawn.
Helps with Crusader Kings III.
#+begin_src conf
# gl_bind_framebuffer = 0
#+end_src

*** Don't swap origin if using GL_UPPER_LEFT. Helps with Ryujinx.
#+begin_src conf
# gl_dont_flip = 1
#+end_src

** Interaction
*** Change toggle keybinds for the hud & logging
#+begin_src conf
# toggle_hud=Shift_R+F12
# toggle_fps_limit=Shift_L+F1
# toggle_logging=Shift_L+F2
# reload_cfg=Shift_L+F4
# upload_log=Shift_L+F3
#+end_src

** Log
*** Automatically start the log after X seconds
#+begin_src conf
# autostart_log = 1
#+end_src

*** Set amount of time in seconds that the logging will run for
#+begin_src conf
# log_duration
#+end_src

*** Set location of the output files (required for logging)
#+begin_src conf
# output_folder = /home/<USERNAME>/mangologs
#+end_src

*** Permit uploading logs directly to FlightlessMango.com
#+begin_src conf
# permit_upload=1
#+end_src

*** Define a '+'-separated list of percentiles shown in the benchmark results.
Use "AVG" to get a mean average. Default percentiles are 97+AVG+1+0.1
#+begin_src conf
# benchmark_percentiles=
#+end_src


