.config/MangoHud/MangoHud.conf

# Comma-separated list of one or more FPS values (e.g. 0,30,60). 0 means unlimited (unless VSynced).

# [[file:../../Dotfiles.org::*Limit the application FPS.][Limit the application FPS.:1]]
# fps_limit=
# Limit the application FPS.:1 ends here


# [0-3] 0 = adaptive; 1 = off; 2 = mailbox; 3 = on

# [[file:../../Dotfiles.org::*VSync][VSync:1]]
# vsync=
# VSync:1 ends here


# [0-N] 0 = off; >=1 = wait for N v-blanks, N > 1 acts as a FPS limiter (FPS = display refresh rate / N)

# [[file:../../Dotfiles.org::*OpenGL VSync][OpenGL VSync:1]]
# gl_vsync=
# OpenGL VSync:1 ends here

# [[file:../../Dotfiles.org::*Custom text centered useful for a header][Custom text centered useful for a header:1]]
# custom_text_center =
# Custom text centered useful for a header:1 ends here

# [[file:../../Dotfiles.org::*Legacy layout][Legacy layout:1]]
legacy_layout = false
# Legacy layout:1 ends here

# [[file:../../Dotfiles.org::*Display the current CPU information][Display the current CPU information:1]]
cpu_stats
cpu_temp
cpu_power
# cpu_text = "CPU"
cpu_mhz
cpu_load_change
cpu_load_value
cpu_load_color
# Display the current CPU information:1 ends here

# [[file:../../Dotfiles.org::*Display the current GPU information][Display the current GPU information:1]]
gpu_stats
gpu_temp
gpu_core_clock
gpu_mem_clock
gpu_name
gpu_power
# gpu_text = "GPU"
# vulkan_driver
gpu_load_change
gpu_load_value
gpu_load_color
# Display the current GPU information:1 ends here

# [[file:../../Dotfiles.org::*Display FPS and frametime][Display FPS and frametime:1]]
fps
# fps_sampling_period=
frametime
# Display FPS and frametime:1 ends here

# [[file:../../Dotfiles.org::*Display loaded MangoHud architecture][Display loaded MangoHud architecture:1]]
# arch
# Display loaded MangoHud architecture:1 ends here

# [[file:../../Dotfiles.org::*Display the frametime line graph][Display the frametime line graph:1]]
frame_timing
histogram
# Display the frametime line graph:1 ends here

# [[file:../../Dotfiles.org::*Display the current system time][Display the current system time:1]]
# time
# Display the current system time:1 ends here

# [[file:../../Dotfiles.org::*Display the current resolution][Display the current resolution:1]]
# resolution
# Display the current resolution:1 ends here

# [[file:../../Dotfiles.org::*Show current fps limit][Show current fps limit:1]]
#  show_fps_limit
# Show current fps limit:1 ends here

# [[file:../../Dotfiles.org::*Display custom text][Display custom text:1]]
# custom_text
# Display custom text:1 ends here

# [[file:../../Dotfiles.org::*Time formatting examples][Time formatting examples:1]]
# time_format = %H:%M
# time_format = [ %T %F ]
# time_format = %X # locally formatted time, because of limited glyph range, missing characters may show as '?' (e.g. Japanese)
# Time formatting examples:1 ends here

# [[file:../../Dotfiles.org::*Change the hud font size (default is 24)][Change the hud font size (default is 24):1]]
font_size=16
# font_scale=1.0
# font_size_text=24
# font_scale_media_player = 0.55
# no_small_font
# Change the hud font size (default is 24):1 ends here

# [[file:../../Dotfiles.org::*Set font for the whole hud][Set font for the whole hud:1]]
# font_file=
# Set font for the whole hud:1 ends here

# [[file:../../Dotfiles.org::*Set font only for text like media player metadata][Set font only for text like media player metadata:1]]
# font_file_text=
# Set font only for text like media player metadata:1 ends here


# Defaults to latin-only. Don't forget to set font_file/text_font_file to font that
# supports these.  Probably don't enable all at once because of memory usage and
# hardware limits concerns.  If you experience crashes or text is just squares,
# reduce glyph range or reduce font size.

# [[file:../../Dotfiles.org::*Set font glyph ranges.][Set font glyph ranges.:1]]
# font_glyph_ranges=korean, chinese, chinese_simplified, japanese, cyrillic, thai, vietnamese, latin_ext_a, latin_ext_b
# Set font glyph ranges.:1 ends here

# [[file:../../Dotfiles.org::*Change the hud position (default is top-left)][Change the hud position (default is top-left):1]]
position=top-left
# Change the hud position (default is top-left):1 ends here

# [[file:../../Dotfiles.org::*Display the current CPU load & frequency for each core][Display the current CPU load & frequency for each core:1]]
# core_load
# core_load_change
# Display the current CPU load & frequency for each core:1 ends here

# [[file:../../Dotfiles.org::*IO read and write for the app (not system)][IO read and write for the app (not system):1]]
# io_read
# io_write
# io_stats
# IO read and write for the app (not system):1 ends here

# [[file:../../Dotfiles.org::*Display system ram / swap space / vram usage][Display system ram / swap space / vram usage:1]]
ram
# swap
vram
# Display system ram / swap space / vram usage:1 ends here

# [[file:../../Dotfiles.org::*Display MangoHud, engine or Wine version][Display MangoHud, engine or Wine version:1]]
# version
# engine_version
# wine
# Display MangoHud, engine or Wine version:1 ends here

# [[file:../../Dotfiles.org::*Disable / hide the hud by default][Disable / hide the hud by default:1]]
# no_display
# Disable / hide the hud by default:1 ends here

# [[file:../../Dotfiles.org::*Hud position offset][Hud position offset:1]]
# offset_x=
# offset_y=
# Hud position offset:1 ends here

# [[file:../../Dotfiles.org::*Hud dimensions][Hud dimensions:1]]
# width=
# height=
# table_columns=
# cellpadding_y=
# Hud dimensions:1 ends here

# [[file:../../Dotfiles.org::*Hud transparency / alpha][Hud transparency / alpha:1]]
background_alpha=0.5
# alpha=
# Hud transparency / alpha:1 ends here

# [[file:../../Dotfiles.org::*Color customization][Color customization:1]]
# text_color=FFFFFF
# gpu_color=2E9762
# cpu_color=2E97CB
# vram_color=AD64C1
# ram_color=C26693
# engine_color=EB5B5B
# io_color=A491D3
# frametime_color=00FF00
# background_color=020202
# media_player_color=FFFFFF
# wine_color=732010
# Color customization:1 ends here

# [[file:../../Dotfiles.org::*Show media player metadata][Show media player metadata:1]]
# media_player
# media_player_name = spotify
# media_player_order = title,artist,album
# Show media player metadata:1 ends here


# Set to 'domain:bus:slot.function'

# [[file:../../Dotfiles.org::*Specify gpu with pci bus id for amdgpu and NVML stats.][Specify gpu with pci bus id for amdgpu and NVML stats.:1]]
# pci_dev = 0:0a:0.0
# Specify gpu with pci bus id for amdgpu and NVML stats.:1 ends here

# [[file:../../Dotfiles.org::*Blacklist][Blacklist:1]]
# blacklist =
# Blacklist:1 ends here


# Options are "viewport", "scissorbox" or disabled. Defaults to using glXQueryDrawable.

# [[file:../../Dotfiles.org::*Specify what to use for getting display size.][Specify what to use for getting display size.:1]]
# gl_size_query = viewport
# Specify what to use for getting display size.:1 ends here


# Helps with Crusader Kings III.

# [[file:../../Dotfiles.org::*(Re)bind given framebuffer before MangoHud gets drawn.][(Re)bind given framebuffer before MangoHud gets drawn.:1]]
# gl_bind_framebuffer = 0
# (Re)bind given framebuffer before MangoHud gets drawn.:1 ends here

# [[file:../../Dotfiles.org::*Don't swap origin if using GL_UPPER_LEFT. Helps with Ryujinx.][Don't swap origin if using GL_UPPER_LEFT. Helps with Ryujinx.:1]]
# gl_dont_flip = 1
# Don't swap origin if using GL_UPPER_LEFT. Helps with Ryujinx.:1 ends here

# [[file:../../Dotfiles.org::*Change toggle keybinds for the hud & logging][Change toggle keybinds for the hud & logging:1]]
# toggle_hud=Shift_R+F12
# toggle_fps_limit=Shift_L+F1
# toggle_logging=Shift_L+F2
# reload_cfg=Shift_L+F4
# upload_log=Shift_L+F3
# Change toggle keybinds for the hud & logging:1 ends here

# [[file:../../Dotfiles.org::*Automatically start the log after X seconds][Automatically start the log after X seconds:1]]
# autostart_log = 1
# Automatically start the log after X seconds:1 ends here

# [[file:../../Dotfiles.org::*Set amount of time in seconds that the logging will run for][Set amount of time in seconds that the logging will run for:1]]
# log_duration
# Set amount of time in seconds that the logging will run for:1 ends here

# [[file:../../Dotfiles.org::*Set location of the output files (required for logging)][Set location of the output files (required for logging):1]]
# output_folder = /home/<USERNAME>/mangologs
# Set location of the output files (required for logging):1 ends here

# [[file:../../Dotfiles.org::*Permit uploading logs directly to FlightlessMango.com][Permit uploading logs directly to FlightlessMango.com:1]]
# permit_upload=1
# Permit uploading logs directly to FlightlessMango.com:1 ends here


# Use "AVG" to get a mean average. Default percentiles are 97+AVG+1+0.1

# [[file:../../Dotfiles.org::*Define a '+'-separated list of percentiles shown in the benchmark results.][Define a '+'-separated list of percentiles shown in the benchmark results.:1]]
# benchmark_percentiles=
# Define a '+'-separated list of percentiles shown in the benchmark results.:1 ends here
